# Microsoft Sentinel Analytics Rule - Minimal Template

id: "{{GUID}}"
name: "New Detection Rule"
description: |
  'Identifies suspicious activity that requires investigation'
severity: "Medium"
requiredDataConnectors:
  - connectorId: "AzureActiveDirectory"
    dataTypes:
      - "SigninLogs"
queryFrequency: "PT5M"
queryPeriod: "P1D"
triggerOperator: "gt"
triggerThreshold: 0
tactics:
  - "InitialAccess"
techniques:
  - "T1078"
tags:
  - "SecurityOps"
query: |
  SigninLogs
  | where TimeGenerated >= ago(1d)
  | take 10
entityMappings:
  - entityType: "Account"
    fieldMappings:
      - identifier: "FullName"
        columnName: "UserPrincipalName"
version: "1.0.0"
kind: "Scheduled"